In [1]:
import utils

In [2]:
import sys
sys.executable

'/Users/murtazajalal/opt/anaconda3/bin/python'

In [3]:
#-- !/usr/local/bin/python3 -m pip install psycopg2-binary

In [4]:
orders_query = """
Select 
    id as order_id
   ,geo_region_id
   ,vehicle_id
   ,pickup_time
FROM 
    orders as o
LIMIT 10
"""

In [5]:
utils.fetch_data(orders_query, 'oms_prod_snapshot')

Query run time in seconds : 0.6891169548034668

/Users/murtazajalal/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   order_id  geo_region_id  vehicle_id  pickup_time
0  14519622              2          97   1603792191
1  15057354              1          96   1605101311
2  17752307              1          97   1611900003
3  16849235              3          91   1609748847
4  15058294              5          97   1605102285
5  14319756              3          91   1603191242
6  16634646              2          97   1609221222
7  14781397              3           1   1604480103
8  14236688              5          97   1602925420
9  14316820              1           8   1603188517

In [6]:
tickets_query = """
        SELECT Day,
                count(DISTINCT customer_crt_id) FILTER (WHERE caller_type = 1) as Partner_Calls,
                count(DISTINCT customer_crt_id) FILTER (WHERE caller_type = 2) as Customer_Calls
        FROM
        (
        SELECT 
            DATE(response_ts + INTERVAL '5 hours 30 minutes') as Day,
            customer_crt_id,
            customer_id,
            driver_id,
            caller_type
        FROM 
            caller_responses
        WHERE 
            response_ts >= CURRENT_DATE::TIMESTAMP - INTERVAL '5 Days 5 hours 30 minutes'
            AND
            response_ts < CURRENT_DATE::TIMESTAMP - INTERVAL '5 hours 30 minutes'
        ) as calls
        GROUP BY 1
        """

In [ ]:
tickets_df = utils.fetch_data(tickets_query, 'oms_prod_snapshot')
print(f'Dimension of the given table is {tickets_df.shape}')
tickets_df.head()

/Users/murtazajalal/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [ ]:
import os, time

In [ ]:
import yaml